# ST445 Managing and Visualizing Data

## Week 3 Assignment, MT 2017
---
**Note: This assignment will be assessed.  Deadline: 5pm, 18 October 2017**

### A.  Normalizing data (40 points).

This question uses this table:
![Not normalized data](http://www.essentialsql.com/wp-content/uploads/2014/06/Intro-Table-Not-Normalized.png)

from [the lecture notes](https://github.com/lse-st445/lectures/blob/master/week03/ST445_wk3_lecture.ipynb#normalization-example).  For each answer, please explain as fully as possible, and feel free to use tables or diagrams if you prefer.

1\.  Why does this table violate the first normal form, and what would be required to make it 1NF?

This table violates the first normal form because it has information of the same type (customer names) in more than one columns. In order to follow 1NF, the table needs to be transformed from wide format to long format.

|  EmployeeID |  SalesPerson    |   SalesOffice|  OfficeNumber|   CustomerName  |
| -----------:|:----------------|:------------:|:------------:|:---------------:|
| 1003        | Mary Smith      |  Chicago     | 312-555-1212 |  Ford           |
| 1003        | Mary Smith      |  Chicago     | 312-555-1212 |  GM             |
| 1004        | John Hunt       |  New York    | 212-555-1212 |  Dell           |
| 1004        | John Hunt       |  New York    | 212-555-1212 |  HP             |
| 1004        | John Hunt       |  New York    | 212-555-1212 |  Apple          |
| 1005        | Martin Hap      |  Chicago     | 312-555-1212 |  Boeing         |

2\.  What additional steps would be needed to make the table 2NF, and why?

As per the Second Normal Form there must not be any partial dependency of any column on primary key. Here, the 2NF is violated because the information under OfficeNumber does not depend on the primary key {Employee ID, CustomerName}. 
While the table follows 1NF, it shows inefficient use of space and it violates 2NF. To achieve 2NF, it is useful to split out the CustomerName in a separate table. 

 |  EmployeeID |  SalesPerson    |  SalesOffice   |  OfficeNumber | 
 | -----------:|:----------------|:---------------|:-------------:|
 | 1003        | Mary Smith      |  Chicago       | 312-555-1212  | 
 | 1004        | John Hunt       |  New York      | 212-555-1212  |
 | 1005        | Martin Hap      |  Chicago       | 312-555-1212  |
 
      
 
 |  EmployeeID |  CustomerName   |   
 | -----------:|:----------------|
 | 1003        |  Ford           |
 | 1003        |  GM             |
 | 1004        |  Dell           | 
 | 1004        |  HP             |
 | 1004        |  Apple          |
 | 1005        |  Boeing         |
 
The data can be normalized further to follow the 3NF by splitting the first table in two separate tables. Based on the 3NF there are no dependencies on non-key attributes. In other words, no column is transitively dependent on the primary key. By splitting out the SalesOffice and OfficeNumber in their own table. This way data will not suffer from insertion, deletion or updating anomalies.

| EmployeeID  |  SalesPerson    |   
| -----------:|:----------------|
| 1003        | Mary Smith      |   
| 1004        | John Hunt       |  
| 1005        | Martin Hap      |  

| EmployeeID  |   SalesOffice   |  OfficeNumber  | 
| -----------:|:----------------|:---------------|
| 1003        |   Chicago       | 312-555-1212   | 
| 1004        |   New York      | 212-555-1212   |
| 1005        |   Chicago       | 312-555-1212   |

|  EmployeeID |  CustomerName   |   
| -----------:|:----------------|
| 1003        |  Ford           |
| 1003        |  GM             |
| 1004        |  Dell           | 
| 1004        |  HP             |
| 1004        |  Apple          |
| 1005        |  Boeing         |

3\.  Why might we not want to normalize data to the fullest extent possible?

This data can be further normalized, for instance by splitting out the SalesOffice and OfficeNumber in a separate table.
In general, data normalization is helpful because it helps to avoid redundancies, and anomalies with updating, deleting and inserting data. 
However, from a practical perspective, data normalization has limits. Reading highly normalized data may result in lower performance, as for each row in one table, you have to read all rows in the related tables. 

Therefore, de-normalized data or data which is not normalized to the fullest extend possible is usually easier to access, yet it takes more space.

4\.  In the table below, which of the three normalization rules does this violate, if any, and why?

   |  countryID  |  countryName    |   EUmember   |  EUjoindate  |
   | -----------:|:----------------|:------------:|:------------:|
   | 00001       | France          |  `true`      |  1958-01-01  |
   | 00004       | Hungary         |  `true`      |  2004-05-01  |
   | 00003       | Serbia          |  `false`     |       `NULL` |
   | 00004       | Finland         |  `true`      |  1995-01-01  |
   | 00005       | Russia          |  `false`     |       `NULL` |
   | 00006       | Ireland, UK     |  `true`      |  1973-01-01  |

   Are there any other problems with the table, besides normalization?

The table violates 1NF because there is repeating information of the same type in one column (countryName). According to 1NF, each set of column must have a unique value, such that multiple columns cannot be used to fetch the same row.

Besides, the countryID is not unique for each countryName, which means that countryID cannot be used as primary key, but countryName can be used as primary key.

5\.  What would it take to full (1NF-3NF) normalize this dataset?

   Write out these tables, and describe why this meets each of the normal forms.  This is a database of movies watched on NetBricks, a streaming movie service.

   | Name           | Address    |   Movies Rented   |  Salutation  | Category |
   |:---------------|:-----------|:------------------|:------------:|----------|
   | Bob Smith      | 1 Houghton Street    | _Star Wars_, _Inception_ |  Dr.   |  Scifi, Scifi |
   | Pry Ministair  | 10 Downing St     |  _Brexit the Movie_      |  Lady  | Tragedy |
   | Joe Bloggs     | 8 Myhatt St.      |  _Fast and Furious 6_, _Fast and Furious 7_     | Mr. | Action, Action |

To follow 1NF we need to split out the information in Movies Rented and Category columns so that there is only one movie name and one category on each row. 

| Name           | Address    |   Movies Rented   |  Salutation  | Category |
|:---------------|:-----------|:------------------|:------------:|----------|
| Bob Smith      | 1 Houghton Street    | _Star Wars_ |  Dr.   |  Scifi |
| Bob Smith      | 1 Houghton Street    | _Inception_ |  Dr.   |  Scifi |
| Pry Ministair  | 10 Downing St     |  _Brexit the Movie_      |  Lady  | Tragedy |
| Joe Bloggs     | 8 Myhatt St.      |  _Fast and Furious 6_     | Mr. |  Action |
| Joe Bloggs     | 8 Myhatt St.      |  _Fast and Furious 7_     | Mr. | Action |

For 2NF normalization we need to split data into two tables to eliminate partial dependencies on the primary key. As data in column Name might not be unique (two people with the same name can live at different addresses and rent different movies). Hence we require both Name and Address to act as primary key.

|  ID   | Name           | Address              |    Salutation  | 
|:-----:|:---------------|:---------------------|:---------------|
|  1    | Bob Smith      | 1 Houghton Street    |    Dr.         |
|  1    | Bob Smith      | 1 Houghton Street    |    Dr.         |  
|  2    | Pry Ministair  | 10 Downing St        |    Lady        |
|  3    | Joe Bloggs     | 8 Myhatt St.         |    Mr.         |
|  3    | Joe Bloggs     | 8 Myhatt St.         |    Mr.         |

|  ID   |   Movies Rented        |   Category |
|:------|:-----------------------|:-----------|
|  1    |  _Star Wars_           |   Scifi    |
|  1    |  _Inception_           |   Scifi    |
|  2    |  _Brexit the Movie_    |   Tragedy  |
|  3    |  _Fast and Furious 6_  |   Action   |
|  3    |  _Fast and Furious 7_  |   Action   |

For 3NF we meed to separate Name and Address in their own table and link the other tables to the ID which is the primary key. All other columns depend directly only on the primary key, following the 3NF.

|  ID   | Name           | Address          |    
|:-----:|:---------------|:-----------------|
|  1    | Bob Smith      | 1 Houghton Street| 
|  2    | Pry Ministair  | 10 Downing St    | 
|  3    | Joe Bloggs     | 8 Myhatt St.     |

|  ID   |    Salutation  | 
|:-----:|:--------------:|
|  1    |    Dr.         |
|  2    |    Lady        | 
|  3    |    Mr.         | 
   

|  ID   |   Movies Rented        |   Category |
|:------|:-----------------------|:-----------|
|  1    |  _Star Wars_           |   Scifi    |
|  1    |  _Inception_           |   Scifi    |
|  2    |  _Brexit the Movie_    |   Tragedy  |
|  3    |  _Fast and Furious 6_  |   Action   |
|  3    |  _Fast and Furious 7_  |   Action   |

### B.  Reshaping data (30 points)

For this exercise, we will use the **nycflights13** R package, whose tables have been output in `.csv` form [here](nycflights13/).  You may do the following in either R or Python.  Note that this example is developed extensively in [_R for Data Science_](http://r4ds.had.co.nz/relational-data.html).

1\.  Create a subtable of the `flights` data, that departed before 05:53 on 2013-02-28.  How many rows and columns does this subtable have?

In [ ]:
library(readr)airports <- read_csv("flights.csv", strings as Factors = FALSE)
flights2 <- subset(flights, month == 2 & day == 28 & dep_time < 553)
View(flights2) 

This subtable has 10 rows of data and just as many columns as the original table, flights: 20. 
nrow(flights2)
[1] 10
ncol(flights2)
[1] 20

2\.  Merge or join the subtable from a. `airports` data, to produce a result that includes:  
   *  Departure time
   *  Carrier (two digit code, from `carrier`)
   *  Flight number
   *  Destination airport name (hint: you will need to get this from the `airports` table)

In [2]:
library(readr)airports <- read_csv("airports.csv", strings as Factors = FALSE)
flights3 <- subset(flights, select = c(5, 11, 12, 15))
airports2 <- subset(airports, select = c(2, 3))
colnames(airports2) <- c("dest","name")
merge( x = flights3, y = airports2, by = "dest", all.x=T)

3\.  For every airline that had flights in the `flights` data compute the average age of the planes it flew from the entire dataset.  Age here will be defined as 2013 minus the `year` variable from the `planes` data.  Hint: This involves a join operation on `tailnum`, but also a grouped mean to compute the age (and subtracting 2013, which you can do before or after the computation of the mean).

In [ ]:
library(readr)planes <- read_csv ("planes.csv", strings as Factors = FALSE)
planes_flights <- merge(x=planes, y=flights, by = "tailnum", all.x=T)
planes_flights <- within(planes_flights, age <- 2013 - year.x)

### C.  Working with SQL.  (30 points)

1\.  Create a relational dataset in SQLite using the `.csv` data found [here](nycflights13/).  Name each table so that it matches the base filenames of the input data.  You can use DB Browser for this, but describe how you did it. If you use SQL commands, include that. You can also use R with the library [RSQLite](https://cran.r-project.org/web/packages/RSQLite/RSQLite.pdf). If you use R, put your codes here.

Create a new database in DB Browser for SQLite. 
Import table from csv file for all tables in .csv format in the nycflights13.

2\.  Replicate B2 above using an SQL query, including both the command and the output.

[your answer]

3\.  Replicate B3 above using an SQL query, including both the command and the output.

[your answer]